burrbull/stm32g4xx-hal/src/serial/usart.rs
use core::fmt::{self, Debug};
use core::marker::PhantomData;

use crate::dma::{
    mux::DmaMuxResources, traits::TargetAddress, MemoryToPeripheral, PeripheralToMemory,
};
use crate::gpio::{self, OpenDrain};
use crate::rcc::{BusClock, Enable, Rcc, RccBus, Reset};
use crate::stm32::*;

use cortex_m::interrupt;
use enumflags2::BitFlags;
use nb::block;

use embedded_hal_old::serial::Write;
use embedded_io::{ReadReady, WriteReady};

use crate::serial::config::*;
/// Serial error
#[derive(Debug)]
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
pub enum Error {
    /// Framing error
    Framing,
    /// Noise error
    Noise,
    /// RX buffer overrun
    Overrun,
    /// Parity check error
    Parity,
}

impl embedded_io::Error for Error {
    fn kind(&self) -> embedded_io::ErrorKind {
        match self {
            Error::Framing => embedded_io::ErrorKind::InvalidData,
            Error::Noise => embedded_io::ErrorKind::InvalidData,
            Error::Overrun => embedded_io::ErrorKind::Other,
            Error::Parity => embedded_io::ErrorKind::InvalidData,
        }
    }
}

#[enumflags2::bitflags]
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Debug, Eq, PartialEq, Copy, Clone)]
#[repr(u32)]
pub enum Event {
    /// IDLE interrupt
    Idle = 1 << 4,
    /// RX buffer not empty interrupt
    RxNotEmpty = 1 << 5,
    /// TX complete interrupt
    TransmissionComplete = 1 << 6,
    /// Tx buffer empty interrupt
    TxEmpty = 1 << 7,
    /// Parity error interrupt
    ParityError = 1 << 8,
    /// Character match interrupt enable
    CharacterMatch = 1 << 14,
    /// Receiver timeout interrupt
    ReceiverTimeout = 1 << 26,
    /// End-of-block interrupt
    EndOfBlock = 1 << 27,
    /// TXFIFO empty interrupt
    TxFifoEmpty = 1 << 30,
    /// RXFIFO full interrupt
    RxFifoFull = 1 << 31,
}

/// UART interrupt events
#[enumflags2::bitflags]
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Debug, Eq, PartialEq, Copy, Clone)]
#[repr(u32)]
pub enum RxEvent {
    /// IDLE interrupt enable
    Idle = 1 << 4,
    /// RXNE interrupt enable
    RxNotEmpty = 1 << 5,
    /// PE interrupt enable
    ParityError = 1 << 8,
    /// Character match interrupt enable
    CharacterMatch = 1 << 14,
    /// Receiver timeout interrupt
    ReceiverTimeout = 1 << 26,
    /// End-of-block interrupt
    EndOfBlock = 1 << 27,
    /// RXFIFO full interrupt
    RxFifoFull = 1 << 31,
}

/// UART interrupt events
#[enumflags2::bitflags]
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Debug, Eq, PartialEq, Copy, Clone)]
#[repr(u32)]
pub enum TxEvent {
    /// Transmission complete interrupt enable
    TransmissionComplete = 1 << 6,
    /// TXE interrupt enable
    TxEmpty = 1 << 7,
    /// TXFIFO empty interrupt
    TxFifoEmpty = 1 << 30,
}

/// UART/USART status flags
#[enumflags2::bitflags]
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Debug, Eq, PartialEq, Copy, Clone)]
#[repr(u32)]
pub enum Flag {
    /// Parity error
    ParityError = 1 << 0,
    /// Framing error
    FramingError = 1 << 1,
    /// Noise detected flag
    Noise = 1 << 2,
    /// Overrun error
    Overrun = 1 << 3,
    /// IDLE line detected
    Idle = 1 << 4,
    /// Read data register not empty
    ///
    /// New data has been received
    RxNotEmpty = 1 << 5,
    /// Transmission complete
    ///
    /// The last data written in the USART_TDR has been transmitted out of the shift register
    TransmissionComplete = 1 << 6,
    /// Transmit data register empty
    ///
    /// New data can be sent
    TxEmpty = 1 << 7,
    /// LIN break detection flag
    LinBreak = 1 << 8,
    /// CTS interrupt
    CtsInterrupt = 1 << 9,
    /// CTS flag
    CtsStatus = 1 << 10,
    /// Receiver timeout
    ///
    /// This bit is set by hardware when the timeout value,
    /// programmed in the RTOR register has lapsed, without any communication
    ReceiverTimeout = 1 << 11,
    /// End of block
    EndOfBlock = 1 << 12,
    /// SPI slave underrun error flag
    Underrun = 1 << 13,
    /// Auto baud rate error
    AutoBaudRateError = 1 << 14,
    /// Auto baud rate
    AutoBaudRateFlag = 1 << 15,
    /// Busy flag
    ///
    /// Active when a communication is ongoing on the RX line
    Busy = 1 << 16,
    /// Character match
    CharacterMatch = 1 << 17,
    /// Send break
    SendBreak = 1 << 18,
    /// Receiver wakeup from Mute mode
    ReceiverWakeup = 1 << 19,
    /// Wake-up from low-power mode flag
    Wakeup = 1 << 20,
    /// Transmit enable acknowledge
    TransmitEnableAck = 1 << 21,
    /// Receive enable acknowledge
    ReceiveEnableAck = 1 << 22,
    /// TXFIFO empty
    TxFifoEmpty = 1 << 23,
    /// RXFIFO full
    RxFifoFull = 1 << 24,
    /// Transmission complete before guard time
    TransmissionCompleteBeforeGuard = 1 << 25,
    /// RXFIFO threshold flag
    ///
    /// This bit is set by hardware when the threshold programmed in RXFTCFG in USART_CR3 register is reached
    RxFifoThreshold,
    /// TXFIFO reaches the threshold
    TxFifoThreshold,
}

#[enumflags2::bitflags]
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Debug, Eq, PartialEq, Copy, Clone)]
#[repr(u32)]
pub enum CFlag {
    /// Parity error
    ParityError = 1 << 0,
    /// Framing error
    FramingError = 1 << 1,
    /// Noise detected flag
    Noise = 1 << 2,
    /// Overrun error
    Overrun = 1 << 3,
    /// IDLE line detected
    Idle = 1 << 4,
    /// Read data register not empty
    RxNotEmpty = 1 << 5,
    /// Transmission complete
    TransmissionComplete = 1 << 6,
    /// Transmit data register empty
    TxEmpty = 1 << 7,
    /// LIN break detection flag
    LinBreak = 1 << 8,
    /// CTS interrupt
    CtsInterrupt = 1 << 9,
    /// Receiver timeout
    ReceiverTimeout = 1 << 11,
    /// End of block
    EndOfBlock = 1 << 12,
    /// SPI slave underrun error flag
    Underrun = 1 << 13,
    /// Character match
    CharacterMatch = 1 << 17,
    /// Wake-up from low-power mode flag
    Wakeup = 1 << 20,
}

