burrbull/stm32g4xx-hal/src/serial/usart.rs
/// Serial receiver
pub struct Rx<USART, Pin, Dma> {
    pin: Pin,
    _usart: PhantomData<USART>,
    _dma: PhantomData<Dma>,
}

/// Serial transmitter
pub struct Tx<USART, Pin, Dma> {
    pin: Pin,
    usart: USART,
    _dma: PhantomData<Dma>,
}

/// Serial abstraction
pub struct Serial<USART, TXPin, RXPin> {
    tx: Tx<USART, TXPin, NoDMA>,
    rx: Rx<USART, RXPin, NoDMA>,
}

/// Serial TX pin
pub trait TxPin<USART> {}

/// Serial RX pin
pub trait RxPin<USART> {}

pub struct NoTx;

impl<USART> TxPin<USART> for NoTx {}

/// Type state for Tx/Rx, indicating operation without DMA
#[derive(Debug)]
pub struct NoDMA;
/// Type state for Tx/Rx, indicating configuration for DMA
#[derive(Debug)]
pub struct DMA;

pub trait SerialExt<USART, Config> {
    fn usart<TX, RX>(
        self,
        tx: TX,
        rx: RX,
        config: Config,
        rcc: &mut Rcc,
    ) -> Result<Serial<USART, TX, RX>, InvalidConfig>
    where
        TX: TxPin<USART>,
        RX: RxPin<USART>;
}

impl<USART, TX, RX> fmt::Write for Serial<USART, TX, RX>
where
    Self: embedded_hal_old::serial::Write<u8>,
    <Self as embedded_hal_old::serial::Write<u8>>::Error: Debug,
{
    fn write_str(&mut self, s: &str) -> fmt::Result {
        for c in s.as_bytes() {
            block!(self.write(*c)).unwrap(); // self.write does not fail
        }
        Ok(())
    }
}

impl<USART, Pin, Dma> fmt::Write for Tx<USART, Pin, Dma>
where
    Self: embedded_hal_old::serial::Write<u8>,
    <Self as embedded_hal_old::serial::Write<u8>>::Error: Debug,
{
    fn write_str(&mut self, s: &str) -> fmt::Result {
        for c in s.as_bytes() {
            block!(self.write(*c)).unwrap(); // self.write does not fail
        }
        Ok(())
    }
}

macro_rules! uart_shared {
    ($USARTX:ident, $dmamux_rx:ident, $dmamux_tx:ident,
        tx: [ $($( #[ $pmeta1:meta ] )* ($PTX:ident, $TAF:ident),)+ ],
        rx: [ $($( #[ $pmeta2:meta ] )* ($PRX:ident, $RAF:ident),)+ ]) => {

        $(
            $( #[ $pmeta1 ] )*
            impl TxPin<$USARTX> for gpio::$PTX<gpio::$TAF> {
            }
            $( #[ $pmeta1 ] )*
            impl TxPin<$USARTX> for gpio::$PTX<gpio::$TAF<OpenDrain>> {
            }
        )+

        $(
            $( #[ $pmeta2 ] )*
            impl RxPin<$USARTX> for gpio::$PRX<gpio::$RAF> {
            }
        )+

        impl<Pin> Rx<$USARTX, Pin, NoDMA> {
            pub fn enable_dma(self) -> Rx<$USARTX, Pin, DMA> {
                // NOTE(unsafe) critical section prevents races
                cortex_m::interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmar().set_bit());
                });

                Rx {
                    pin: self.pin,
                    _usart: PhantomData,
                    _dma: PhantomData,
                }
            }
            fn data_ready(&mut self) -> nb::Result<(), Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                let isr = usart.isr().read();
                Err(
                    if isr.pe().bit_is_set() {
                        usart.icr().write(|w| w.pecf().clear());
                        nb::Error::Other(Error::Parity)
                    } else if isr.fe().bit_is_set() {
                        usart.icr().write(|w| w.fecf().clear());
                        nb::Error::Other(Error::Framing)
                    } else if isr.nf().bit_is_set() {
                        usart.icr().write(|w| w.ncf().clear());
                        nb::Error::Other(Error::Noise)
                    } else if isr.ore().bit_is_set() {
                        usart.icr().write(|w| w.orecf().clear());
                        nb::Error::Other(Error::Overrun)
                    } else if isr.rxne().bit_is_set() {
                        return Ok(())
                    } else {
                        nb::Error::WouldBlock
                    }
                )
            }
        }

        impl<Pin> Rx<$USARTX, Pin, DMA> {
            pub fn disable_dma(self) -> Rx<$USARTX, Pin, NoDMA> {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmar().clear_bit());
                });

                Rx {
                    pin: self.pin,
                    _usart: PhantomData,
                    _dma: PhantomData,
                }
            }
        }

        impl<Pin> embedded_hal_old::serial::Read<u8> for Rx<$USARTX, Pin, NoDMA> {
            type Error = Error;

            fn read(&mut self) -> nb::Result<u8, Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                self.data_ready().map(|_| usart.rdr().read().bits() as u8)
            }
        }

        impl<TX, RX> embedded_hal_old::serial::Read<u8> for Serial<$USARTX, TX, RX> {
            type Error = Error;

            fn read(&mut self) -> nb::Result<u8, Error> {
                self.rx.read()
            }
        }

        impl<Pin> Tx<$USARTX, Pin, NoDMA> {
            pub fn enable_dma(self) -> Tx<$USARTX, Pin, DMA> {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmat().set_bit());
                });

                Tx {
                    pin: self.pin,
                    usart: self.usart,
                    _dma: PhantomData,
                }
            }
        }

        impl<Pin> Tx<$USARTX, Pin, DMA> {
            pub fn disable_dma(self) -> Tx<$USARTX, Pin, NoDMA> {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmat().clear_bit());
                });

                Tx {
                    pin: self.pin,
                    usart: self.usart,
                    _dma: PhantomData,
                }
            }
        }

        impl<Pin> embedded_hal_old::serial::Write<u8> for Tx<$USARTX, Pin, NoDMA> {
            type Error = Error;

            fn flush(&mut self) -> nb::Result<(), Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if usart.isr().read().tc().bit_is_set() {
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }

            fn write(&mut self, byte: u8) -> nb::Result<(), Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if usart.isr().read().txe().bit_is_set() {
                    usart.tdr().write(|w| unsafe { w.bits(byte as u32) });
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }
        }

