burrbull/stm32g4xx-hal/src/serial/usart.rs
        impl<TX, RX> embedded_hal_old::serial::Write<u8> for Serial<$USARTX, TX, RX> {
            type Error = Error;

            fn flush(&mut self) -> nb::Result<(), Self::Error> {
                self.tx.flush()
            }

            fn write(&mut self, byte: u8) -> nb::Result<(), Self::Error> {
                self.tx.write(byte)
            }
        }

        impl<Pin> embedded_io::ErrorType for Tx<$USARTX, Pin, NoDMA> {
            type Error = Error;
        }
        impl<Pin> WriteReady for Tx<$USARTX, Pin, NoDMA> {
            fn write_ready(&mut self) -> Result<bool, Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                Ok(usart.isr().read().txe().bit_is_set())
            }
        }
        // writes until fifo (or tdr) is full
        impl<Pin> embedded_io::Write for Tx<$USARTX, Pin, NoDMA> {
            fn write(&mut self, buf: &[u8]) -> Result<usize, Self::Error> {
                if buf.len() == 0 { return Ok(0) }
                let usart = unsafe { &(*$USARTX::ptr()) };
                while !self.write_ready()? {
                    core::hint::spin_loop()
                }
                // can't know fifo capacity in advance
                let count = buf.into_iter()
                    .take_while(|_| usart.isr().read().txe().bit_is_set())
                    .map(|b| usart.tdr().write(|w| unsafe { w.tdr().bits(*b as u16) }))
                    .count();

                Ok(count)
            }
            fn flush(&mut self) -> Result<(), Error> {
                nb::block!(embedded_hal_old::serial::Write::<u8>::flush(self))
            }
        }

        impl<Pin> embedded_io::ErrorType for Rx<$USARTX, Pin, NoDMA> {
            type Error = Error;
        }
        impl<Pin> ReadReady for Rx<$USARTX, Pin, NoDMA> {
            fn read_ready(&mut self) -> Result<bool, Self::Error> {
                match self.data_ready() {
                    Ok(()) => Ok(true),
                    Err(nb::Error::WouldBlock) => Ok(false),
                    Err(nb::Error::Other(e)) => Err(e),
                }
            }
        }
        impl<Pin> embedded_io::Read for Rx<$USARTX, Pin, NoDMA> {
            fn read(&mut self, buf: &mut [u8]) -> Result<usize, Self::Error> {
                if buf.len() == 0 { return Ok(0) }
                let usart = unsafe { &(*$USARTX::ptr()) };
                let mut count = 0;

                while !self.read_ready()? {
                    core::hint::spin_loop()
                }
                while self.read_ready()? && count < buf.len() {
                    buf[count] = usart.rdr().read().bits() as u8;
                    count += 1
                }
                Ok(count)
            }
        }

        impl<TX, RX> embedded_io::ErrorType for Serial<$USARTX, TX, RX> {
            type Error = Error;
        }
        impl<TX, RX> WriteReady for Serial<$USARTX, TX, RX> {
            fn write_ready(&mut self) -> Result<bool, Self::Error> {
                self.tx.write_ready()
            }
        }
        impl<TX, RX> embedded_io::Write for Serial<$USARTX, TX, RX> {
            fn write(&mut self, buf: &[u8]) -> Result<usize, Self::Error> {
                embedded_io::Write::write(&mut self.tx, buf)
            }
            fn flush(&mut self) -> Result<(), Error> {
                embedded_io::Write::flush(&mut self.tx)
            }
        }
        impl<TX, RX> ReadReady for Serial<$USARTX, TX, RX> {
            fn read_ready(&mut self) -> Result<bool, Self::Error> {
                self.rx.read_ready()
            }
        }
        impl<TX, RX> embedded_io::Read for Serial<$USARTX, TX, RX> {
            fn read(&mut self, buf: &mut [u8]) -> Result<usize, Self::Error> {
                embedded_io::Read::read(&mut self.rx, buf)
            }
        }

        impl<TX, RX> Serial<$USARTX, TX, RX> {

            /// Separates the serial struct into separate channel objects for sending (Tx) and
            /// receiving (Rx)
            pub fn split(self) -> (Tx<$USARTX, TX, NoDMA>, Rx<$USARTX, RX, NoDMA>) {
                (self.tx, self.rx)
            }

            /// Joins the objects created by `split()` back into one Serial object.
            ///
            /// This function can be used in combination with `release()` to deinitialize the
            /// peripheral after it has been split.
            pub fn join(
                tx: Tx<$USARTX, TX, NoDMA>,
                rx: Rx<$USARTX, RX, NoDMA>,
            ) -> Self {
                Serial{
                    tx,
                    rx,
                }
            }

            /// Disables the USART and returns the peripheral as well the pins.
            ///
            /// This function makes the components available for further use. For example, the
            /// USART can later be reinitialized with a different baud rate or other configuration
            /// changes.
            pub fn release(self) -> ($USARTX, TX, RX) {
                // Disable the UART as well as its clock.
                self.tx.usart.cr1().modify(|_, w| w.ue().clear_bit());
                unsafe {
                    $USARTX::disable_unchecked();
                }
                (self.tx.usart, self.tx.pin, self.rx.pin)
            }
        }

        unsafe impl<Pin> TargetAddress<MemoryToPeripheral> for Tx<$USARTX, Pin, DMA> {
            #[inline(always)]
            fn address(&self) -> u32 {
                // unsafe: only the Tx part accesses the Tx register
                unsafe { &*<$USARTX>::ptr() }.tdr() as *const _ as u32
            }

            type MemSize = u8;

            const REQUEST_LINE: Option<u8> = Some(DmaMuxResources::$dmamux_tx as u8);
        }

        unsafe impl<Pin> TargetAddress<PeripheralToMemory> for Rx<$USARTX, Pin, DMA> {
            #[inline(always)]
            fn address(&self) -> u32 {
                // unsafe: only the Rx part accesses the Rx register
                unsafe { &*<$USARTX>::ptr() }.rdr() as *const _ as u32
            }

            type MemSize = u8;

