burrbull/stm32g4xx-hal/src/serial/usart.rs
            const REQUEST_LINE: Option<u8> = Some(DmaMuxResources::$dmamux_rx as u8);
        }

        impl<TX, RX> crate::Listen for Serial<$USARTX, TX, RX> {
            type Event = Event;
            #[inline(always)]
            fn listen_event(
                &mut self,
                disable: Option<BitFlags<Self::Event>>,
                enable: Option<BitFlags<Self::Event>>,
            ) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.listen_event(disable.map(BitFlags::bits), enable.map(BitFlags::bits))
            }
        }

        impl<Pin, Dma> crate::Listen for Rx<$USARTX, Pin, Dma> {
            type Event = RxEvent;
            #[inline(always)]
            fn listen_event(
                &mut self,
                disable: Option<BitFlags<Self::Event>>,
                enable: Option<BitFlags<Self::Event>>,
            ) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.listen_event(disable.map(BitFlags::bits), enable.map(BitFlags::bits))
            }
        }

        impl<Pin, Dma> crate::Listen for Tx<$USARTX, Pin, Dma> {
            type Event = TxEvent;
            #[inline(always)]
            fn listen_event(
                &mut self,
                disable: Option<BitFlags<Self::Event>>,
                enable: Option<BitFlags<Self::Event>>,
            ) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.listen_event(disable.map(BitFlags::bits), enable.map(BitFlags::bits))
            }
        }

        impl<TX, RX> crate::ReadFlags for Serial<$USARTX, TX, RX> {
            type Flag = Flag;
            #[inline(always)]
            fn flags(&self) -> BitFlags<Self::Flag> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.flags()
            }
        }

        impl<TX, RX> crate::ClearFlags for Serial<$USARTX, TX, RX> {
            type Flag = CFlag;
            #[inline(always)]
            fn clear_flags(&mut self, flags: impl Into<BitFlags<CFlag>>) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.clear_flags(flags.into())
            }
        }

        impl<Pin, Dma> crate::ReadFlags for Rx<$USARTX, Pin, Dma> {
            type Flag = Flag;
            #[inline(always)]
            fn flags(&self) -> BitFlags<Self::Flag> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.flags()
            }
        }

        impl<Pin, Dma> crate::ClearFlags for Rx<$USARTX, Pin, Dma> {
            type Flag = CFlag;
            #[inline(always)]
            fn clear_flags(&mut self, flags: impl Into<BitFlags<CFlag>>) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.clear_flags(flags.into())
            }
        }

        impl<Pin, Dma> crate::ReadFlags for Tx<$USARTX, Pin, Dma> {
            type Flag = Flag;
            #[inline(always)]
            fn flags(&self) -> BitFlags<Self::Flag> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.flags()
            }
        }

        impl<Pin, Dma> crate::ClearFlags for Tx<$USARTX, Pin, Dma> {
            type Flag = CFlag;
            #[inline(always)]
            fn clear_flags(&mut self, flags: impl Into<BitFlags<CFlag>>) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.clear_flags(flags.into())
            }
        }
    }
}

macro_rules! uart_lp {
    ($USARTX:ident,
        $usartX:ident, $clk_mul:expr
    ) => {
        impl SerialExt<$USARTX, LowPowerConfig> for $USARTX {
            fn usart<TX, RX>(
                self,
                tx: TX,
                rx: RX,
                config: LowPowerConfig,
                rcc: &mut Rcc,
            ) -> Result<Serial<$USARTX, TX, RX>, InvalidConfig>
            where
                TX: TxPin<$USARTX>,
                RX: RxPin<$USARTX>,
            {
                Serial::$usartX(self, tx, rx, config, rcc)
            }
        }

        impl<TX, RX> Serial<$USARTX, TX, RX>
        where
            TX: TxPin<$USARTX>,
            RX: RxPin<$USARTX>,
        {
            pub fn $usartX(
                usart: $USARTX,
                tx: TX,
                rx: RX,
                config: LowPowerConfig,
                rcc: &mut Rcc,
            ) -> Result<Self, InvalidConfig> {
                // Enable clock for USART
                $USARTX::enable(rcc);
                $USARTX::reset(rcc);

                // TODO: By default, all UARTs are clocked from PCLK. We could modify RCC_CCIPR to
                // try SYSCLK if PCLK is not high enough. We could also select 8x oversampling
                // instead of 16x.

                let clk = <$USARTX as RccBus>::Bus::clock(&rcc.clocks).raw() as u64;
                let bdr = config.baudrate.0 as u64;
                let div = ($clk_mul * clk) / bdr;
                if div < 16 {
                    // We need 16x oversampling.
                    return Err(InvalidConfig);
                }
                usart.brr().write(|w| unsafe { w.bits(div as u32) });
                // Reset the UART and disable it (UE=0)
                usart.cr1().reset();
                // Reset other registers to disable advanced USART features
                usart.cr2().reset();
                usart.cr3().reset();

                usart.cr2().write(|w| unsafe {
                    w.stop()
                        .bits(config.stopbits.bits())
                        .swap()
                        .bit(config.swap)
                        .txinv()
                        .bit(config.tx_invert)
                        .rxinv()
                        .bit(config.rx_invert)
                });

                usart.cr3().write(|w| unsafe {
                    w.txftcfg()
                        .bits(config.tx_fifo_threshold.bits())
                        .rxftcfg()
                        .bits(config.rx_fifo_threshold.bits())
                        .txftie()
                        .bit(config.tx_fifo_interrupt)
                        .rxftie()
                        .bit(config.rx_fifo_interrupt)
                });

                // Enable the UART and perform remaining configuration.
                usart.cr1().write(|w| {
                    w.ue()
                        .set_bit()
                        .te()
                        .set_bit()
                        .re()
                        .set_bit()
                        .m1()
                        .bit(config.wordlength == WordLength::DataBits7)
                        .m0()
                        .bit(config.wordlength == WordLength::DataBits9)
                        .pce()
                        .bit(config.parity != Parity::ParityNone)
                        .ps()
                        .bit(config.parity == Parity::ParityOdd)
                        .fifoen()
                        .bit(config.fifo_enable)
                });

