burrbull/stm32g4xx-hal/src/serial/usart.rs
                Ok(Serial {
                    tx: Tx {
                        pin: tx,
                        usart,
                        _dma: PhantomData,
                    },
                    rx: Rx {
                        pin: rx,
                        _usart: PhantomData,
                        _dma: PhantomData,
                    },
                })
            }
        }
    };
}

pub trait RBExt {
    fn flags(&self) -> BitFlags<Flag>;
    fn clear_flags(&self, flags: BitFlags<CFlag>);
    fn listen_event(&self, disable: Option<u32>, enable: Option<u32>);
}

macro_rules! rbext {
    ($usartX:ident) => {
        impl RBExt for crate::pac::$usartX::RegisterBlock {
            #[inline(always)]
            fn flags(&self) -> BitFlags<Flag> {
                unsafe { BitFlags::from_bits_unchecked(self.isr().read().bits()) }
            }
            #[inline(always)]
            fn clear_flags(&self, flags: BitFlags<CFlag>) {
                self.icr().write(|w| unsafe { w.bits(flags.bits()) });
            }
            #[inline(always)]
            fn listen_event(&self, disable: Option<u32>, enable: Option<u32>) {
                self.cr1().modify(|r, w| unsafe {
                    w.bits({
                        let mut bits = r.bits();
                        if let Some(d) = disable {
                            bits &= !d;
                        }
                        if let Some(e) = enable {
                            bits |= e;
                        }
                        bits
                    })
                });
            }
        }
    };
}
rbext!(usart1);
rbext!(uart4);
rbext!(lpuart1);

macro_rules! uart_full {
    ($USARTX:ident,
        $usartX:ident
    ) => {
        impl SerialExt<$USARTX, FullConfig> for $USARTX {
            fn usart<TX, RX>(
                self,
                tx: TX,
                rx: RX,
                config: FullConfig,
                rcc: &mut Rcc,
            ) -> Result<Serial<$USARTX, TX, RX>, InvalidConfig>
            where
                TX: TxPin<$USARTX>,
                RX: RxPin<$USARTX>,
            {
                Serial::$usartX(self, tx, rx, config, rcc)
            }
        }

        impl<TX, RX> Serial<$USARTX, TX, RX>
        where
            TX: TxPin<$USARTX>,
            RX: RxPin<$USARTX>,
        {
            pub fn $usartX(
                usart: $USARTX,
                tx: TX,
                rx: RX,
                config: FullConfig,
                rcc: &mut Rcc,
            ) -> Result<Self, InvalidConfig> {
                // Enable clock for USART
                $USARTX::enable(rcc);
                $USARTX::reset(rcc);

                // TODO: By default, all UARTs are clocked from PCLK. We could modify RCC_CCIPR to
                // try SYSCLK if PCLK is not high enough. We could also select 8x oversampling
                // instead of 16x.

                let clk = <$USARTX as RccBus>::Bus::clock(&rcc.clocks).raw() as u64;
                let bdr = config.baudrate.0 as u64;
                let clk_mul = 1;
                let div = (clk_mul * clk) / bdr;
                if div < 16 {
                    // We need 16x oversampling.
                    return Err(InvalidConfig);
                }
                usart.brr().write(|w| unsafe { w.bits(div as u32) });

                // Reset the UART and disable it (UE=0)
                usart.cr1().reset();
                usart.cr2().reset();
                usart.cr3().reset();

                usart.cr2().write(|w| unsafe {
                    w.stop()
                        .bits(config.stopbits.bits())
                        .swap()
                        .bit(config.swap)
                        .txinv()
                        .bit(config.tx_invert)
                        .rxinv()
                        .bit(config.rx_invert)
                });

                if let Some(timeout) = config.receiver_timeout {
                    usart.cr1().write(|w| w.rtoie().set_bit());
                    usart.cr2().modify(|_, w| w.rtoen().set_bit());
                    usart.rtor().write(|w| unsafe { w.rto().bits(timeout) });
                }

                usart.cr3().write(|w| unsafe {
                    w.txftcfg()
                        .bits(config.tx_fifo_threshold.bits())
                        .rxftcfg()
                        .bits(config.rx_fifo_threshold.bits())
                        .txftie()
                        .bit(config.tx_fifo_interrupt)
                        .rxftie()
                        .bit(config.rx_fifo_interrupt)
                });

                // Enable the UART and perform remaining configuration.
                usart.cr1().modify(|_, w| {
                    w.ue()
                        .set_bit()
                        .te()
                        .set_bit()
                        .re()
                        .set_bit()
                        .m1()
                        .bit(config.wordlength == WordLength::DataBits7)
                        .m0()
                        .bit(config.wordlength == WordLength::DataBits9)
                        .pce()
                        .bit(config.parity != Parity::ParityNone)
                        .ps()
                        .bit(config.parity == Parity::ParityOdd)
                        .fifoen()
                        .bit(config.fifo_enable)
                });

                Ok(Serial {
                    tx: Tx {
                        pin: tx,
                        usart,
                        _dma: PhantomData,
                    },
                    rx: Rx {
                        pin: rx,
                        _usart: PhantomData,
                        _dma: PhantomData,
                    },
                })
            }
        }

        impl<Pin, Dma> Rx<$USARTX, Pin, Dma> {
            /// Check if receiver timeout has lapsed
            /// Returns the current state of the ISR RTOF bit
            pub fn timeout_lapsed(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().rtof().bit_is_set()
            }

            /// Clear pending receiver timeout interrupt
            pub fn clear_timeout(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.icr().write(|w| w.rtocf().clear());
            }
        }
    };
}

uart_shared!(USART1, USART1_RX, USART1_TX,
tx: [
    (PA9, AF7),
    (PB6, AF7),
    (PC4, AF7),
    (PE0, AF7),
    #[cfg(any(feature = "stm32g473", feature = "stm32g474", feature = "stm32g483", feature = "stm32g484"))]
    (PG9, AF7),
],
rx: [
    (PA10, AF7),
    (PB7, AF7),
    (PC5, AF7),
    (PE1, AF7),
]);

