burrbull/stm32g4xx-hal/src/serial/usart.rs
uart_shared!(USART2, USART2_RX, USART2_TX,
    tx: [
        (PA2, AF7),
        (PA14, AF7),
        (PB3, AF7),
        (PD5, AF7),
    ],
    rx: [
        (PA3, AF7),
        (PA15, AF7),
        (PB4, AF7),
        (PD6, AF7),
    ]
);

uart_shared!(USART3, USART3_RX, USART3_TX,
    tx: [
        (PB9, AF7),
        (PB10, AF7),
        (PC10, AF7),
        (PD8, AF7),
    ],
    rx: [
        (PB8, AF7),
        (PB11, AF7),
        (PC11, AF7),
        (PD9, AF7),
        (PE15, AF7),
    ]
);

uart_shared!(UART4, USART4_RX, USART4_TX,
    tx: [
        (PC10, AF5),
    ],
    rx: [
        (PC11, AF5),
    ]
);

#[cfg(not(any(feature = "stm32g431", feature = "stm32g441")))]
uart_shared!(UART5, USART5_RX, USART5_TX,
    tx: [
        (PC12, AF5),
    ],
    rx: [
        (PD2, AF5),
    ]
);

uart_shared!(LPUART1, LPUART1_RX, LPUART1_TX,
    tx: [
        (PA2, AF12),
        (PB11, AF8),
        (PC1, AF8),
        #[cfg(any(feature = "stm32g473", feature = "stm32g474", feature = "stm32g483", feature = "stm32g484"))]
        (PG7, AF8),
    ],
    rx: [
        (PA3, AF12),
        (PB10, AF8),
        (PC0, AF8),
        #[cfg(any(feature = "stm32g473", feature = "stm32g474", feature = "stm32g483", feature = "stm32g484"))]
        (PG8, AF8),
    ]
);

uart_full!(USART1, usart1);
uart_full!(USART2, usart2);
uart_full!(USART3, usart3);

uart_full!(UART4, uart4);
#[cfg(not(any(feature = "stm32g431", feature = "stm32g441")))]
uart_full!(UART5, uart5);

// LPUART Should be given its own implementation when it needs to be used with features not present on
// the basic feature set such as: Dual clock domain, FIFO or prescaler.
// Or when Synchronous mode is implemented for the basic feature set, since the LP feature set does not have support.
uart_lp!(LPUART1, lpuart1, 256);
